Tekla Open API Reference for Tekla Structures 2025
Contour.CalculatePolygon Method
 Calculate a polygon approximating the contour with chamfers evaluated.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CalculatePolygon(
	out Polygon polygon
)
Public Function CalculatePolygon (
	<OutAttribute> ByRef polygon As Polygon
) As Boolean
Parameters
polygon
Type: Tekla.Structures.Model.Polygon
The calculated Polygon.
Return Value
Type: Boolean
True if successful, otherwise false.
See Also
Reference
Contour Class
Tekla.Structures.Model Namespace